app/Models/ModelUser.php

SELECT *
FROM `tb_user`
WHERE `email` = 'raditya@gmail.com'
---
    public function dapatkan_user($email = false)
    {
        if ($email === false) {
            return $this->findAll();
        } else {
            return $this->where('email', $email)->get();