app/Models/ModelNotes.php

    public function tambah_notes($data)
    {
        $builder = $this->db->table($this->table);
        return $this->insert($data);
---
INSERT INTO `tb_notes` (`id_user`, `judul`, `isi`, `tanggal`) VALUES ('1', 'Tugas Pa Aries yang ga masuk masuk', 'SOAL FUZZY 100 SOAL', '2024-11-12')

    public function dapatkan_notes()
    {
        return $this->findAll();
---
SELECT *
FROM `tb_notes`

    public function semua_notes($id_user)
    {
        $query = $this->db->table('tb_notes');
        $batasan = $query->select('*')
        ->join('tb_user', 'tb_user.id_user = tb_notes.id_user')
        ->where('tb_notes.id_user', $id_user)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `tb_notes`
JOIN `tb_user` ON `tb_user`.`id_user` = `tb_notes`.`id_user`
WHERE `tb_notes`.`id_user` IS NULL

    public function hapus_notes($id_notes)
    {
        $builder = $this->db->table($this->table);
        return $builder->delete(['id_notes' => $id_notes]);
---
DELETE FROM `tb_notes`
WHERE `id_notes` = '11'